wrk/result1.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 1 connections
  Thread calibration: mean lat.: 1611.392ms, rate sampling interval: 3885ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.54s     2.08s    8.99s    58.14%
    Req/Sec     0.33      0.47     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.51s 
 75.000%    7.26s 
 90.000%    8.38s 
 99.000%    8.99s 
 99.900%    8.99s 
 99.990%    8.99s 
 99.999%    8.99s 
100.000%    8.99s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2228.223     0.000000            1         1.00
    2707.455     0.100000            5         1.11
    3334.143     0.200000            9         1.25
    3878.911     0.300000           13         1.43
    4722.687     0.400000           18         1.67
    5509.119     0.500000           22         2.00
    6062.079     0.550000           24         2.22
    6414.335     0.600000           26         2.50
    6684.671     0.650000           28         2.86
    7065.599     0.700000           31         3.33
    7393.279     0.750000           33         4.00
    7532.543     0.775000           34         4.44
    7655.423     0.800000           35         5.00
    7827.455     0.825000           36         5.71
    8036.351     0.850000           37         6.67
    8224.767     0.875000           38         8.00
    8384.511     0.887500           39         8.89
    8384.511     0.900000           39        10.00
    8519.679     0.912500           40        11.43
    8519.679     0.925000           40        13.33
    8658.943     0.937500           41        16.00
    8658.943     0.943750           41        17.78
    8658.943     0.950000           41        20.00
    8839.167     0.956250           42        22.86
    8839.167     0.962500           42        26.67
    8839.167     0.968750           42        32.00
    8839.167     0.971875           42        35.56
    8839.167     0.975000           42        40.00
    8994.815     0.978125           43        45.71
    8994.815     1.000000           43          inf
#[Mean    =     5538.364, StdDeviation   =     2079.532]
#[Max     =     8986.624, Total count    =           43]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  51 requests in 1.00m, 16.30MB read
Requests/sec:      0.85
Transfer/sec:    278.08KB