wrk/result10.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 10 connections
  Thread calibration: mean lat.: 5192.021ms, rate sampling interval: 15400ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.43s    12.16s   46.89s    55.26%
    Req/Sec     2.00      0.00     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.89s 
 75.000%   38.70s 
 90.000%   44.07s 
 99.000%   46.83s 
 99.900%   46.92s 
 99.990%   46.92s 
 99.999%   46.92s 
100.000%   46.92s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8187.903     0.000000            1         1.00
   10715.135     0.100000           12         1.11
   13598.719     0.200000           23         1.25
   18137.087     0.300000           35         1.43
   23396.351     0.400000           46         1.67
   27885.567     0.500000           57         2.00
   30015.487     0.550000           63         2.22
   31883.263     0.600000           69         2.50
   35323.903     0.650000           75         2.86
   35749.887     0.700000           80         3.33
   38699.007     0.750000           86         4.00
   39354.367     0.775000           89         4.44
   40730.623     0.800000           92         5.00
   41418.751     0.825000           95         5.71
   41910.271     0.850000           97         6.67
   42336.255     0.875000          100         8.00
   43450.367     0.887500          102         8.89
   44072.959     0.900000          103        10.00
   44236.799     0.912500          105        11.43
   44367.871     0.925000          106        13.33
   44793.855     0.937500          107        16.00
   44826.623     0.943750          108        17.78
   45383.679     0.950000          110        20.00
   45383.679     0.956250          110        22.86
   45383.679     0.962500          110        26.67
   46563.327     0.968750          111        32.00
   46563.327     0.971875          111        35.56
   46596.095     0.975000          112        40.00
   46596.095     0.978125          112        45.71
   46596.095     0.981250          112        53.33
   46825.471     0.984375          113        64.00
   46825.471     0.985938          113        71.11
   46825.471     0.987500          113        80.00
   46825.471     0.989062          113        91.43
   46825.471     0.990625          113       106.67
   46923.775     0.992188          114       128.00
   46923.775     1.000000          114          inf
#[Mean    =    27426.798, StdDeviation   =    12156.441]
#[Max     =    46891.008, Total count    =          114]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  138 requests in 1.00m, 41.26MB read
  Socket errors: connect 0, read 0, write 0, timeout 162
Requests/sec:      2.30
Transfer/sec:    703.30KB