wrk/result100.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 100 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.34s   637.78ms  43.94s    61.00%
    Req/Sec     2.09     18.61   444.00     98.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   42.37s 
 75.000%   42.83s 
 90.000%   43.19s 
 99.000%   43.65s 
 99.900%   43.97s 
 99.990%   43.97s 
 99.999%   43.97s 
100.000%   43.97s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   41123.839     0.000000            1         1.00
   41484.287     0.100000           10         1.11
   41680.895     0.200000           20         1.25
   41943.039     0.300000           30         1.43
   42106.879     0.400000           40         1.67
   42369.023     0.500000           51         2.00
   42467.327     0.550000           58         2.22
   42532.863     0.600000           60         2.50
   42598.399     0.650000           66         2.86
   42729.471     0.700000           70         3.33
   42827.775     0.750000           75         4.00
   42860.543     0.775000           78         4.44
   42893.311     0.800000           80         5.00
   43024.383     0.825000           84         5.71
   43057.151     0.850000           85         6.67
   43155.455     0.875000           89         8.00
   43155.455     0.887500           89         8.89
   43188.223     0.900000           91        10.00
   43220.991     0.912500           92        11.43
   43286.527     0.925000           93        13.33
   43352.063     0.937500           95        16.00
   43352.063     0.943750           95        17.78
   43352.063     0.950000           95        20.00
   43450.367     0.956250           96        22.86
   43483.135     0.962500           97        26.67
   43483.135     0.968750           97        32.00
   43515.903     0.971875           98        35.56
   43515.903     0.975000           98        40.00
   43515.903     0.978125           98        45.71
   43646.975     0.981250           99        53.33
   43646.975     0.984375           99        64.00
   43646.975     0.985938           99        71.11
   43646.975     0.987500           99        80.00
   43646.975     0.989062           99        91.43
   43974.655     0.990625          100       106.67
   43974.655     1.000000          100          inf
#[Mean    =    42337.239, StdDeviation   =      637.781]
#[Max     =    43941.888, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  100 requests in 1.01m, 27.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 2900
Requests/sec:      1.65
Transfer/sec:    464.37KB