wrk/result1000.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 1000 connections
  Thread calibration: mean lat.: 13557.113ms, rate sampling interval: 27607ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.77s    10.89s    0.87m    48.35%
    Req/Sec     1.00      0.00     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   32.74s 
 75.000%   43.32s 
 90.000%   50.27s 
 99.000%    0.87m 
 99.900%    0.87m 
 99.990%    0.87m 
 99.999%    0.87m 
100.000%    0.87m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   14041.087     0.000000            1         1.00
   22380.543     0.100000           10         1.11
   23150.591     0.200000           19         1.25
   30965.759     0.300000           28         1.43
   31621.119     0.400000           37         1.67
   32735.231     0.500000           46         2.00
   40927.231     0.550000           51         2.22
   41156.607     0.600000           57         2.50
   41484.287     0.650000           60         2.86
   41877.503     0.700000           65         3.33
   43319.295     0.750000           69         4.00
   49381.375     0.775000           71         4.44
   49512.447     0.800000           73         5.00
   49577.983     0.825000           77         5.71
   49741.823     0.850000           78         6.67
   49872.895     0.875000           80         8.00
   50003.967     0.887500           81         8.89
   50266.111     0.900000           84        10.00
   50266.111     0.912500           84        11.43
   50298.879     0.925000           85        13.33
   50364.415     0.937500           86        16.00
   50364.415     0.943750           86        17.78
   50429.951     0.950000           87        20.00
   50757.631     0.956250           89        22.86
   50757.631     0.962500           89        26.67
   50757.631     0.968750           89        32.00
   50757.631     0.971875           89        35.56
   50757.631     0.975000           89        40.00
   52002.815     0.978125           90        45.71
   52002.815     0.981250           90        53.33
   52002.815     0.984375           90        64.00
   52002.815     0.985938           90        71.11
   52002.815     0.987500           90        80.00
   52035.583     0.989062           91        91.43
   52035.583     1.000000           91          inf
#[Mean    =    35765.687, StdDeviation   =    10886.044]
#[Max     =    52002.816, Total count    =           91]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  110 requests in 1.02m, 29.44MB read
  Socket errors: connect 0, read 0, write 3, timeout 27890
Requests/sec:      1.80
Transfer/sec:    494.06KB