wrk/result1000_index.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 1000 connections
  Thread calibration: mean lat.: 6153.441ms, rate sampling interval: 21987ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.77s    13.24s    0.94m    55.53%
    Req/Sec    10.00      2.00    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.23s 
 75.000%   42.50s 
 90.000%   48.59s 
 99.000%    0.92m 
 99.900%    0.95m 
 99.990%    0.95m 
 99.999%    0.95m 
100.000%    0.95m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7815.167     0.000000            1         1.00
   14065.663     0.100000           47         1.11
   16343.039     0.200000           94         1.25
   19775.487     0.300000          141         1.43
   23035.903     0.400000          188         1.67
   26230.783     0.500000          235         2.00
   29818.879     0.550000          259         2.22
   33193.983     0.600000          282         2.50
   37093.375     0.650000          307         2.86
   39190.527     0.700000          329         3.33
   42500.095     0.750000          353         4.00
   43417.599     0.775000          365         4.44
   44498.943     0.800000          376         5.00
   45383.679     0.825000          388         5.71
   46170.111     0.850000          400         6.67
   47611.903     0.875000          412         8.00
   47972.351     0.887500          418         8.89
   48594.943     0.900000          423        10.00
   49184.767     0.912500          429        11.43
   49709.055     0.925000          435        13.33
   50298.879     0.937500          441        16.00
   50987.007     0.943750          444        17.78
   51675.135     0.950000          447        20.00
   52002.815     0.956250          451        22.86
   52363.263     0.962500          453        26.67
   53116.927     0.968750          456        32.00
   53313.535     0.971875          457        35.56
   53903.359     0.975000          459        40.00
   54132.735     0.978125          461        45.71
   54329.343     0.981250          462        53.33
   54788.095     0.984375          463        64.00
   54886.399     0.985938          464        71.11
   54919.167     0.987500          465        80.00
   54919.167     0.989062          465        91.43
   55181.311     0.990625          466       106.67
   55541.759     0.992188          467       128.00
   55541.759     0.992969          467       142.22
   55902.207     0.993750          468       160.00
   55902.207     0.994531          468       182.86
   55902.207     0.995313          468       213.33
   56328.191     0.996094          469       256.00
   56328.191     0.996484          469       284.44
   56328.191     0.996875          469       320.00
   56328.191     0.997266          469       365.71
   56328.191     0.997656          469       426.67
   56721.407     0.998047          470       512.00
   56721.407     1.000000          470          inf
#[Mean    =    29771.597, StdDeviation   =    13241.667]
#[Max     =    56688.640, Total count    =          470]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  688 requests in 1.00m, 171.02MB read
  Socket errors: connect 0, read 0, write 6, timeout 26508
Requests/sec:     11.46
Transfer/sec:      2.85MB